[
  {
    "title": "TaskGenius",
    "image": "./projectImages/taskgenius.gif",
    "description": "TodoGenius-app, built with React, Javascript, HTML, and CSS, is an efficient organizational tool designed to streamline your daily tasks. This application simplifies task management by providing a clear list of things you need to do and allows you to easily mark them as complete. 📝✅",
    "technologies": "React | Javascript | HTML | CSS ",
    "github": "https://github.com/Odongo006/To-Do-List.git",
    "deployed": "https://todo-genius-app.vercel.app/",
    "bgcolor": "#bba9ff",
    "id": "1"
  },

  {
    "title": "Bookflix",
    "image": "./projectImages/bookflix.gif",
    "description": "Movie is a dynamic platform that leverages React, Ruby on Rails, Postgresql, Bootstrap, and Tailwind to empower users in booking tickets for movie premieres. This feature-rich application allows users to seamlessly manage their bookings, including the ability to cancel reservations. Additionally, users can access comprehensive details about upcoming premieres and contribute their feedback by rating the premieres. 💰💼",
    "technologies": "React | Ruby on Rails | Postgresql | Bootstrap | Tailwind",
    "github": "https://github.com/Odongo006/Bookstore.git",
    "deployed": "https://book-flix-frontend.vercel.app/",
    "bgcolor": "#baf94a",
    "id": "2"
  },
  {
    "title": "Math Magicians",
    "image": "./projectImages/Math Magic.. (1).gif",
    "technologies": "React| JavaScript | CSS",
    "description": "In this React project, I harnessed the power of React, JavaScript, and CSS to craft a comprehensive website for the Math Magicians app. The project encompasses multiple pages, seamlessly integrating the components I've developed. Through the addition of a Home page, Calculator page, and Quotes page, the application offers a diverse and engaging user experience. 🧮🌐📚💻",
     "github": "https://github.com/Odongo006/math-magician-app.git",
    "deployed": "https://math-magicians-s0ze.onrender.com",
    "bgcolor": "#29cbe0",
    "id": "5"
  },
  {
    "title": "Bookstore",
    "image": "./projectImages/bookstore.gif",
    "technologies": "React| Redux | CSS3",
    "description": 
    "The Bookstore, powered by React, Redux, and CSS3, is an innovative book registration website designed to efficiently store books based on their titles and authors. This MVP version enables users to seamlessly display a list of books, add new books to the collection, and remove selected books with ease.",
    "github": "https://github.com/Odongo006/OOP-School-Library.git",
    "deployed": "https://bookstore-mz71.onrender.com",
    "bgcolor": "#6c4bf4",
    "id": "6"
  },
  {
    "title": "Astro Travelers",
    "image": "./projectImages/astro-travelers.gif",
    "technologies": "React | Redux | CSS3",
    "description": "In this collaborative project with my coding partners at Microverse, we utilized React, Redux, and CSS3 to work with real-time data sourced from the SpaceX API. Our objective was to develop a web application for a company specializing in commercial and scientific space travel services. The application seamlessly facilitates users in booking rockets and participating in selected space missions. 📖📝",
    "github": "https://github.com/Lucas-Erkana/Astro-Travelers",
    "deployed": "https://astro-travelers.onrender.com/",
    "bgcolor": "#f85781",
    "id": "7"
  },

  {
    "title": "TV-hub ",
    "image": "./projectImages/tv-hub.gif",
    "description": "TV Hub, crafted with JavaScript, HTML5, CSS3, and Webpack, stands as a comprehensive TV show database website. This platform showcases detailed information about each show, including descriptions and ratings. Users have the ability to search for shows, express their appreciation by liking them, and engage with fellow enthusiasts through comments. The project seamlessly integrates the TVmaze API, ensuring a rich and dynamic user experience. 📺🔍",
    "technologies": "JavaScript | HTML5 | CSS3 | Webpack",
     "github": "https://github.com/Odongo006/React-Metrics-Webapp.git",
    "deployed": "https://moviesgenre.netlify.app/",
    "bgcolor": "#ffcc33",
    "id": "8"
  }, 

  {
    "title": "To do List",
    "image": "./projectImages/todo-list.gif",
    "technologies": "JavaScript | HTML5 | CSS3 | Webpack | Jest",
    "description": "This educational project, powered by JavaScript, HTML5, CSS3, Webpack, and Jest, serves as an organizational tool to structure your day efficiently. The platform simplifies task management by providing a clear list of things you need to do, offering the convenience of marking tasks as complete with ease.",
   "github": "https://github.com/Lucas-Erkana/To_Do_List",
    "deployed": "https://Lucas-Erkana.github.io/To_Do_List/version1.4/dist/",
    "bgcolor": "#3e67ff",
    "id": "9"
  },
  {
    "title": "Awesome Books",
    "image": "./projectImages/awesomebooks.gif",
    "technologies": "JavaScript | HTML5 | CSS3 | Bootstrap",
    "description": "This educational project, utilizing JavaScript, HTML5, CSS3, and Bootstrap, empowers users to curate a list of desired books with the added functionality to delete books. Leveraging local storage, the platform ensures the preservation of data directly within the user's web browser for a seamless and personalized experience.",
   "github": "https://github.com/Lucas-Erkana/Awesome_Book",
    "deployed": "https://Lucas-Erkana.github.io/Awesome_Book/",
    "bgcolor": "#2ff3e0",
    "id": "10"
  }

]
